ZeroZap/XinYi/boards/pandora_stm32l475/rtos_main.c
#include "stm32l4xx_hal.h"
#include "stm32l4xx_hal_tim.h"
#include "pandora_platform_startup.h"
#include "xy_broker.h"
#include "xy_broker_isr_ingress.h"
#include "xy_device.h"
#include "xy_fota.h"
#include "xy_fota_boot.h"
#include "xy_fota_w25q128.h"
#include "xy_hal_dma.h"
#include "xy_hal_gpio.h"
#include "xy_hal_qspi.h"
#include "xy_hal_rtc.h"
#include "xy_hal_spi.h"
#include "xy_hal_sys.h"
#include "xy_hal_timer.h"
#include "xy_hal_uart.h"
#include "xy_os.h"
#include "xy_pm.h"
#include "xy_stdio.h"
#include "xy_w25q128.h"

#ifndef XINYI_FIRMWARE_COMMIT
#error "XINYI_FIRMWARE_COMMIT must identify the source commit used for this image"
#endif

static UART_HandleTypeDef uart1;
static xy_os_semaphore_id_t sync_sem;
static xy_os_msgqueue_id_t sync_queue;
static xy_os_event_flags_id_t sync_events;
static xy_os_mutex_id_t sync_mutex;
static xy_os_msgqueue_id_t multi_queue;
xy_os_semaphore_id_t pandora_isr_sem;
xy_os_semaphore_id_t pandora_tim6_sem;
xy_os_semaphore_id_t pandora_dma_sem;
xy_os_semaphore_id_t pandora_ipc_isr_sem;
xy_broker_isr_ingress_t pandora_ipc_isr_ingress;
static xy_broker_isr_msg_t pandora_ipc_isr_storage[4];
volatile uint32_t pandora_ipc_isr_attempts;
volatile uint32_t pandora_ipc_isr_accepted;
volatile uint32_t pandora_ipc_isr_full;
volatile int pandora_ipc_isr_result;
TIM_HandleTypeDef pandora_tim6;
static uint32_t shared_sequence;
static uint32_t ipc_expected_sequence;
static uint32_t ipc_delivered_count;
static uint32_t ipc_probe_sequence = UINT32_MAX;
static bool ipc_probe_reject;
static uint32_t ipc_isr_last_sequence;
static uint32_t ipc_isr_delivered;
static uint32_t pm_last_tick;
static uint32_t multi_seen[2];
static uint32_t multi_received_count;
static uint32_t multi_consumer_counts[2];
static uint32_t multi_producers_done;
static uint32_t multi_consumers_done;
static xy_device_t ipc_device = {
    .name = "pandora-ipc",
    .type = XY_DEV_TYPE_MISC,
    .state = XY_DEV_STATE_CLOSED,
};
static uint8_t resource_pool_memory[2U * sizeof(uint32_t)];
DMA_HandleTypeDef dma1_channel1;
DMA_HandleTypeDef spi1_tx_dma;
static SPI_HandleTypeDef spi1;
static QSPI_HandleTypeDef qspi;
static xy_w25q128_t w25q128;
static uint32_t dma_source[8];
static uint32_t dma_destination[8];
static volatile xy_hal_dma_event_t dma_event;
static volatile xy_hal_spi_event_t spi_event;
static uint32_t w25q128_mcu_reset_recovery_pending;

#define SYNC_EVENT_DATA_READY (1UL << 0)
#define BLOCKING_TIMEOUT_TICKS 100U
#define BLOCKING_TIMEOUT_TOLERANCE_TICKS 20U
#define MULTI_MESSAGES_PER_PRODUCER 8U
#define MULTI_STOP_PRODUCER 0xFFFFFFFFU
#define IPC_ISR_STREAM_COUNT 16U
#define IPC_ISR_STRESS_CYCLES 12U
#define IPC_ISR_STRESS_INTERVAL_TICKS 44000U
#define IPC_ISR_SEQUENCE_FLAG 0x80000000U
#define W25Q128_TEST_ADDRESS 0x00FFF000U
#define W25Q128_TEST_LENGTH 256U
#define W25Q128_MCU_RESET_MAGIC 0x51315253U
#define W25Q128_FOTA_TEST_ADDRESS 0x00FFE000U
#define W25Q128_FOTA_TEST_SIZE 4096U
#define W25Q128_FOTA_IMAGE_ADDRESS 0x00F00000U
#define W25Q128_FOTA_IMAGE_SIZE 0x00080000U
#define PANDORA_FOTA_CONFIRM_REQUEST_MAGIC 0x46525132U
#define PANDORA_FOTA_CONFIRM_ACK_MAGIC 0x46414332U

extern const uint8_t __flash_image_end;

static const xy_hal_qspi_config_t w25q128_qspi_config = {
    .clock_prescaler = 3U,
    .fifo_threshold = 1U,
    .flash_size_bits = 24U,
    .chip_select_high_cycles = 2U,
    .sample_shift_half_cycle = 0U,
    .clock_mode = 0U,
};

typedef struct {
    uint32_t producer;
    uint32_t sequence;
} multi_message_t;

void _init(void) {}
void _fini(void) {}

void vApplicationStackOverflowHook(void *task, char *task_name)
{
    (void)task;
    (void)task_name;
    __disable_irq();
    for (;;) {
    }
}

static void fail(void)
{
    __disable_irq();
    for (;;) {
    }
}

static void dma_callback(void *dma, xy_hal_dma_event_t event, void *arg)
{
    (void)dma;
    (void)arg;
    dma_event = event;
    (void)xy_os_semaphore_release_from_isr(pandora_dma_sem);
}

static void spi_callback(void *spi, xy_hal_spi_event_t event, void *arg)
{
    (void)spi;
    (void)arg;
    spi_event = event;
    (void)xy_os_semaphore_release_from_isr(pandora_dma_sem);
}

static void tim6_callback(void *timer, xy_hal_timer_event_t event, void *arg)
{
    uint32_t sequence;

    (void)timer;
    (void)arg;
    if (event == XY_HAL_TIMER_EVENT_UPDATE) {
        (void)xy_os_semaphore_release_from_isr(pandora_tim6_sem);
        if (pandora_ipc_isr_accepted < 16U) {
            sequence = IPC_ISR_SEQUENCE_FLAG | ++pandora_ipc_isr_attempts;
            pandora_ipc_isr_result = xy_broker_isr_publish(
                &pandora_ipc_isr_ingress, XY_BROKER_SERVER_TIMER, XY_BROKER_SERVER_TIMER,
                XY_BROKER_MSG_SENSOR_DATA, &sequence, sizeof(sequence), XY_BROKER_PRIORITY_HIGH);
            if (pandora_ipc_isr_result == XY_BROKER_OK) {
                ++pandora_ipc_isr_accepted;
            } else if (pandora_ipc_isr_result == XY_BROKER_QUEUE_FULL) {
                ++pandora_ipc_isr_full;
            }
        }
    }
}

static int w25q128_erase_write_read_test(void)
{
    uint8_t expected[W25Q128_TEST_LENGTH];
    uint8_t actual[W25Q128_TEST_LENGTH];

    for (uint32_t index = 0U; index < W25Q128_TEST_LENGTH; ++index) {
        expected[index] = (uint8_t)(index ^ 0xA5U);
        actual[index] = 0U;
    }
    if (xy_w25q128_sector_erase(&w25q128, W25Q128_TEST_ADDRESS, 1000U) != XY_W25Q128_OK ||
        xy_w25q128_page_program(&w25q128, W25Q128_TEST_ADDRESS, expected, sizeof(expected),
                                100U) != XY_W25Q128_OK ||
        xy_w25q128_read(&w25q128, W25Q128_TEST_ADDRESS, actual, sizeof(actual)) !=
            XY_W25Q128_OK) {
        return 0;
    }
    for (uint32_t index = 0U; index < W25Q128_TEST_LENGTH; ++index) {
        if (actual[index] != expected[index]) {
            return 0;
        }
    }
    return 1;
}

static int w25q128_quad_read_test(void)
{
    uint8_t expected[W25Q128_TEST_LENGTH];
    uint8_t actual[W25Q128_TEST_LENGTH];

    for (uint32_t index = 0U; index < W25Q128_TEST_LENGTH; ++index) {
        expected[index] = (uint8_t)(index ^ 0xA5U);
        actual[index] = 0U;
    }
    if (xy_w25q128_quad_read(&w25q128, W25Q128_TEST_ADDRESS, actual, sizeof(actual), 8U) !=
        XY_W25Q128_OK) {
        return 0;
    }
    for (uint32_t index = 0U; index < W25Q128_TEST_LENGTH; ++index) {
        if (actual[index] != expected[index]) {
            return 0;
        }
    }
    return 1;
}

