ZeroZap/XinYi/boards/pandora_stm32l475/rtos_main.c
static int w25q128_quad_program_test(void)
{
    uint8_t expected[W25Q128_TEST_LENGTH];
    uint8_t actual[W25Q128_TEST_LENGTH];

    for (uint32_t index = 0U; index < W25Q128_TEST_LENGTH; ++index) {
        expected[index] = (uint8_t)(index ^ 0x5AU);
        actual[index] = 0U;
    }
    if (xy_w25q128_sector_erase(&w25q128, W25Q128_TEST_ADDRESS, 1000U) != XY_W25Q128_OK ||
        xy_w25q128_quad_page_program(&w25q128, W25Q128_TEST_ADDRESS, expected,
                                     sizeof(expected), 100U) != XY_W25Q128_OK ||
        xy_w25q128_quad_read(&w25q128, W25Q128_TEST_ADDRESS, actual, sizeof(actual), 8U) !=
            XY_W25Q128_OK) {
        return 0;
    }
    for (uint32_t index = 0U; index < W25Q128_TEST_LENGTH; ++index) {
        if (actual[index] != expected[index]) {
            return 0;
        }
    }
    return 1;
}

static int w25q128_fota_full_image_test(void)
{
    const xy_fota_flash_ops_t *fota_ops;
#ifdef PANDORA_FOTA_APPLICATION
    const uint8_t *image = (const uint8_t *)0x08008000U;
#else
    const uint8_t *image = (const uint8_t *)0x08000000U;
#endif
    uint32_t image_size = (uint32_t)((uintptr_t)&__flash_image_end - (uintptr_t)image);
    uint32_t expected_crc;
    xy_fota_t fota;
    xy_fota_boot_candidate_header_t candidate_header = {
        .magic = XY_FOTA_BOOT_CANDIDATE_MAGIC,
        .format_version = XY_FOTA_BOOT_CANDIDATE_FORMAT_VERSION,
        .header_size = sizeof(xy_fota_boot_candidate_header_t),
        .image_offset = sizeof(xy_fota_boot_candidate_header_t),
        .image_version = 2U,
    };
    xy_fota_config_t fota_config = {
        .mode = XY_FOTA_MODE_DUAL_BANK,
        .flash_base_addr = W25Q128_FOTA_IMAGE_ADDRESS + sizeof(candidate_header),
        .slot_size = W25Q128_FOTA_IMAGE_SIZE,
        .slot_count = 1U,
        .enable_rollback = true,
        .min_version = 1U,
    };

#ifdef PANDORA_FOTA_APPLICATION
    candidate_header.load_address = 0x08008000U;
#else
    candidate_header.load_address = 0x08000000U;
#endif

    if (image_size == 0U || image_size > W25Q128_FOTA_IMAGE_SIZE - sizeof(candidate_header)) {
        return 0;
    }
    expected_crc = xy_fota_calc_crc32(image, image_size);
    candidate_header.image_size = image_size;
    candidate_header.image_crc32 = expected_crc;
    if (xy_fota_w25q128_bind(&w25q128, W25Q128_FOTA_IMAGE_ADDRESS,
                              W25Q128_FOTA_IMAGE_SIZE, 1000U) != XY_FOTA_OK ||
        (fota_ops = xy_fota_w25q128_ops()) == NULL || fota_ops->init() != XY_FOTA_OK ||
        fota_ops->erase(W25Q128_FOTA_IMAGE_ADDRESS,
                        image_size + sizeof(candidate_header)) != XY_FOTA_OK ||
        fota_ops->write(W25Q128_FOTA_IMAGE_ADDRESS, (const uint8_t *)&candidate_header,
                        sizeof(candidate_header)) != XY_FOTA_OK ||
        xy_fota_init(&fota, &fota_config) != XY_FOTA_OK ||
        xy_fota_set_flash_ops(&fota, fota_ops) != XY_FOTA_OK ||
        xy_fota_start_download(&fota, 2U, image_size, false) != XY_FOTA_OK ||
        xy_fota_set_expected_crc32(&fota, expected_crc) != XY_FOTA_OK) {
        return 0;
    }
    for (uint32_t offset = 0U; offset < image_size; offset += 256U) {
        uint32_t chunk = image_size - offset;
        if (chunk > 256U) {
            chunk = 256U;
        }
        if (xy_fota_download_chunk(&fota, image + offset, chunk) != XY_FOTA_OK) {
            return 0;
        }
    }
    if (xy_fota_finish_download(&fota) != XY_FOTA_OK) {
        return 0;
    }
    {
        xy_fota_boot_candidate_header_t validated_header;
        xy_fota_boot_candidate_config_t boot_config = {
            .storage_address = W25Q128_FOTA_IMAGE_ADDRESS,
            .storage_size = W25Q128_FOTA_IMAGE_SIZE,
            .execution_limit = 0x0807E000U,
            .sram_base = 0x20000000U,
            .sram_limit = 0x20018000U,
            .sram2_base = 0x10000000U,
            .sram2_limit = 0x10008000U,
            .read = fota_ops->read,
        };
#ifdef PANDORA_FOTA_APPLICATION
        boot_config.execution_base = 0x08008000U;
#else
        boot_config.execution_base = 0x08000000U;
#endif
        if (xy_fota_boot_candidate_validate(&boot_config, &validated_header) != XY_FOTA_OK ||
            validated_header.image_version != 2U || validated_header.image_size != image_size) {
            return 0;
        }
    }
    if (fota_ops->deinit() != XY_FOTA_OK) {
        return 0;
    }
    return 1;
}

static void uart_text(const char *text)
{
    uint16_t length = 0;
    uint32_t primask = __get_PRIMASK();

    __disable_irq();
    while (text[length] != '\0') {
        ++length;
    }
    (void)xy_hal_uart_send(&uart1, (const uint8_t *)text, length, 100U);
    if (primask == 0U) {
        __enable_irq();
    }
}

static void uart_log_text(char *text)
{
    uart_text(text);
}

static void uart_u32(const char *prefix, uint32_t value)
{
    char line[48];
    char digits[10];
    uint32_t digit_count = 0U;
    uint32_t line_length = 0U;

    while (prefix[line_length] != '\0') {
        line[line_length] = prefix[line_length];
        ++line_length;
    }
    do {
        digits[digit_count++] = (char)('0' + value % 10U);
        value /= 10U;
    } while (value != 0U);
    while (digit_count != 0U) {
        line[line_length++] = digits[--digit_count];
    }
    line[line_length++] = '\r';
    line[line_length++] = '\n';
    line[line_length] = '\0';
    uart_text(line);
}

uint32_t xy_os_tick_get(void)
{
    return xy_os_kernel_get_tick_count();
}

static int ipc_handler(const xy_broker_msg_t *msg, void *user_data)
{
    uint32_t sequence;

    (void)user_data;
    if (msg == NULL || msg->msg_id != XY_BROKER_MSG_SENSOR_DATA ||
        msg->payload_len != sizeof(sequence)) {
        return XY_BROKER_ERROR;
    }
    sequence = (uint32_t)msg->payload[0] | ((uint32_t)msg->payload[1] << 8) |
               ((uint32_t)msg->payload[2] << 16) | ((uint32_t)msg->payload[3] << 24);
    if (msg->src_server == XY_BROKER_SERVER_TIMER) {
        uint32_t stream_sequence = sequence & ~IPC_ISR_SEQUENCE_FLAG;

        if ((sequence & IPC_ISR_SEQUENCE_FLAG) == 0U || stream_sequence == 0U ||
            (ipc_isr_delivered > 0U && stream_sequence <= ipc_isr_last_sequence)) {
            return XY_BROKER_ERROR;
        }
        ipc_isr_last_sequence = stream_sequence;
        ++ipc_isr_delivered;
        if (xy_printf("OSAL_IPC_ISR_STREAM_DELIVER %u\r\n", (unsigned int)stream_sequence) < 0) {
            return XY_BROKER_ERROR;
        }
        return XY_BROKER_OK;
    }
    if (sequence == ipc_probe_sequence) {
        return ipc_probe_reject ? XY_BROKER_ERROR : XY_BROKER_OK;
    }
    if (sequence != ipc_expected_sequence || xy_device_find("pandora-ipc") != &ipc_device) {
        return XY_BROKER_ERROR;
    }
    ++ipc_expected_sequence;
    ++ipc_delivered_count;
    uart_text("OSAL_DEVICE_LOOKUP\r\n");
    if (xy_printf("[I] OSAL_TRACE_DELIVER\r\n") < 0) {
        uart_text("OSAL_TRACE_ERROR\r\n");
        return XY_BROKER_ERROR;
    }
    uart_text("OSAL_IPC_DELIVER\r\n");
    return XY_BROKER_OK;
}

static int ipc_isr_wake(void *context)
{
    xy_os_status_t status =
        xy_os_semaphore_release_from_isr((xy_os_semaphore_id_t)context);

    /* A full binary semaphore means a drain wake is already pending. */
    return status == XY_OS_OK || status == XY_OS_ERROR_RESOURCE ? XY_BROKER_OK
                                                                : XY_BROKER_ERROR;
}

static void ipc_isr_task(void *argument)
{
    uint32_t recovery_cycle;

    (void)argument;
    for (recovery_cycle = 0U; recovery_cycle < IPC_ISR_STRESS_CYCLES; ++recovery_cycle) {
        uint32_t cycle_delivery_target = ipc_isr_delivered + IPC_ISR_STREAM_COUNT;
        uint32_t task_producer_start;

