ZeroZap/XinYi/boards/pandora_stm32l475/rtos_main.c
        if (recovery_cycle > 0U) {
            (void)xy_os_delay(IPC_ISR_STRESS_INTERVAL_TICKS);
        }
        if (xy_os_semaphore_acquire(pandora_ipc_isr_sem, 2500U) != XY_OS_OK ||
            pandora_ipc_isr_result == XY_BROKER_ERROR) {
            uart_text("OSAL_IPC_ISR_ERROR\r\n");
            fail();
        }
        task_producer_start = ipc_delivered_count;
        (void)xy_os_delay(6000U);
        if (pandora_ipc_isr_full == 0U) {
            uart_text("OSAL_IPC_ISR_ERROR\r\n");
            fail();
        }
        uart_text("OSAL_IPC_ISR_BACKPRESSURE\r\n");
        while (ipc_isr_delivered < cycle_delivery_target) {
            int result = xy_broker_isr_drain_one(&pandora_ipc_isr_ingress);

            if (result == XY_BROKER_OK) {
                if (xy_broker_process_msgs(XY_BROKER_SERVER_TIMER, 1U) != 1) {
                    uart_text("OSAL_IPC_ISR_ERROR\r\n");
                    fail();
                }
                continue;
            }
            if (result != XY_BROKER_NOT_FOUND ||
                xy_os_semaphore_acquire(pandora_ipc_isr_sem, 1500U) != XY_OS_OK ||
                pandora_ipc_isr_result == XY_BROKER_ERROR) {
                uart_text("OSAL_IPC_ISR_ERROR\r\n");
                fail();
            }
        }
        if (pandora_ipc_isr_accepted != IPC_ISR_STREAM_COUNT ||
            ipc_isr_last_sequence != pandora_ipc_isr_attempts ||
            ipc_delivered_count <= task_producer_start) {
            uart_text("OSAL_IPC_ISR_ERROR\r\n");
            fail();
        }
        uart_text("OSAL_IPC_TASK_PRODUCER_PROGRESS\r\n");
        uart_text("OSAL_IPC_ISR_RECOVERED\r\n");

        __disable_irq();
        pandora_ipc_isr_accepted = 0U;
        pandora_ipc_isr_full = 0U;
        __enable_irq();
    }
    uart_text("OSAL_IPC_ISR_SUSTAINED_OK\r\n");
    xy_os_thread_exit();
}


static void gpio_uart_init(void)
{
    const xy_hal_gpio_config_t led_gpio = {
        XY_HAL_GPIO_MODE_OUTPUT, XY_HAL_GPIO_PULL_NONE, XY_HAL_GPIO_OTYPE_PP,
        XY_HAL_GPIO_SPEED_LOW, 0U,
    };
    const xy_hal_gpio_config_t uart_gpio = {
        XY_HAL_GPIO_MODE_AF, XY_HAL_GPIO_PULL_UP, XY_HAL_GPIO_OTYPE_PP,
        XY_HAL_GPIO_SPEED_VERY_HIGH, GPIO_AF7_USART1,
    };
    const xy_hal_uart_config_t uart_config = {
        115200U, XY_HAL_UART_WORDLEN_8B, XY_HAL_UART_STOPBITS_1, XY_HAL_UART_PARITY_NONE,
        XY_HAL_UART_FLOWCTRL_NONE, XY_HAL_UART_MODE_TX_RX,
    };

    __HAL_RCC_GPIOE_CLK_ENABLE();
    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_USART1_CLK_ENABLE();
    uart1.Instance = USART1;

    if (xy_hal_gpio_init(GPIOE, 7U, &led_gpio) != XY_HAL_OK ||
        xy_hal_gpio_init(GPIOA, 9U, &uart_gpio) != XY_HAL_OK ||
        xy_hal_gpio_init(GPIOA, 10U, &uart_gpio) != XY_HAL_OK ||
        xy_hal_uart_init(&uart1, &uart_config) != XY_HAL_OK) {
        fail();
    }
}

static void tim6_init(void)
{
    const xy_hal_timer_config_t timer_config = {
        .prescaler = 7999U,
        .period = 6999U,
        .mode = XY_HAL_TIMER_COUNT_UP,
        .clock_div = XY_HAL_TIMER_CKDIV_1,
        .auto_reload_preload = 0U,
    };

    __HAL_RCC_TIM6_CLK_ENABLE();
    pandora_tim6.Instance = TIM6;
    if (xy_hal_timer_init(&pandora_tim6, &timer_config) != XY_HAL_OK ||
        xy_hal_timer_register_callback(&pandora_tim6, XY_HAL_TIMER_EVENT_UPDATE, tim6_callback,
                                       NULL) != XY_HAL_OK) {
        fail();
    }
    if (xy_hal_sys_set_irq_priority((uint32_t)TIM6_DAC_IRQn, 5U) != XY_HAL_OK ||
        xy_hal_sys_enable_irq_num((uint32_t)TIM6_DAC_IRQn) != XY_HAL_OK) {
        fail();
    }
}

static void fast_task(void *argument)
{
    uint32_t sequence = 0U;

    (void)argument;
    for (;;) {
        if (xy_os_mutex_acquire(sync_mutex, 100U) != XY_OS_OK) {
            uart_text("OSAL_MUTEX_TIMEOUT\r\n");
            fail();
        }
        shared_sequence = sequence;
        uart_text("OSAL_MUTEX_FAST\r\n");
        if (xy_os_mutex_release(sync_mutex) != XY_OS_OK) {
            fail();
        }
        (void)xy_hal_gpio_toggle(GPIOE, 7U);
        uart_text("OSAL_TASK_FAST\r\n");
        if (xy_os_semaphore_release(sync_sem) != XY_OS_OK) {
            fail();
        }
        if (xy_os_msgqueue_put(sync_queue, &sequence, 0U, 100U) != XY_OS_OK) {
            fail();
        }
        uart_text("OSAL_QUEUE_SEND\r\n");
        if ((xy_os_event_flags_set(sync_events, SYNC_EVENT_DATA_READY) & SYNC_EVENT_DATA_READY) ==
            0U) {
            fail();
        }
        uart_text("OSAL_EVENT_SET\r\n");
        if (xy_broker_send_msg(XY_BROKER_SERVER_SENSOR, XY_BROKER_SERVER_SYSTEM,
                               XY_BROKER_MSG_SENSOR_DATA, &sequence, sizeof(sequence),
                               XY_BROKER_PRIORITY_NORMAL) != XY_BROKER_OK) {
            uart_text("OSAL_IPC_ERROR\r\n");
            fail();
        }
        uart_text("OSAL_IPC_SEND\r\n");
        {
            uint32_t pm_tick = xy_pm_tick_get();
            uint32_t os_tick = xy_os_kernel_get_tick_count();
            if (pm_tick < pm_last_tick || pm_tick > os_tick || os_tick - pm_tick > 1U) {
                uart_text("OSAL_PM_ERROR\r\n");
                fail();
            }
            pm_last_tick = pm_tick;
            uart_text("OSAL_PM_TICK\r\n");
        }
        ++sequence;
        (void)xy_os_delay(500U);
    }
}

static void slow_task(void *argument)
{
    uint32_t expected_sequence = 0U;
    uint32_t sequence;

    (void)argument;
    for (;;) {
        if (xy_os_semaphore_acquire(sync_sem, 1200U) == XY_OS_OK) {
            uart_text("OSAL_SEM_TAKE\r\n");
        } else {
            uart_text("OSAL_SEM_TIMEOUT\r\n");
            fail();
        }
        if ((xy_os_event_flags_wait(sync_events, SYNC_EVENT_DATA_READY, XY_OS_FLAGS_WAIT_ALL,
                                    100U) &
             SYNC_EVENT_DATA_READY) == 0U) {
            uart_text("OSAL_EVENT_MISMATCH\r\n");
            fail();
        }
        uart_text("OSAL_EVENT_WAIT\r\n");
        if (xy_os_msgqueue_get(sync_queue, &sequence, NULL, 100U) != XY_OS_OK ||
            sequence != expected_sequence) {
            uart_text("OSAL_QUEUE_MISMATCH\r\n");
            fail();
        }
        uart_text("OSAL_QUEUE_RECV\r\n");
        if (xy_broker_process_msgs(XY_BROKER_SERVER_SYSTEM, 1U) != 1 ||
            ipc_delivered_count != expected_sequence + 1U) {
            uart_text("OSAL_IPC_ERROR\r\n");
            fail();
        }
        if (xy_os_mutex_acquire(sync_mutex, 100U) != XY_OS_OK) {
            uart_text("OSAL_MUTEX_TIMEOUT\r\n");
            fail();
        }
        if (shared_sequence != sequence) {
            uart_text("OSAL_MUTEX_MISMATCH\r\n");
            fail();
        }
        uart_text("OSAL_MUTEX_SLOW\r\n");
        if (xy_os_mutex_release(sync_mutex) != XY_OS_OK) {
            fail();
        }
        ++expected_sequence;
        uart_text("OSAL_TASK_SLOW\r\n");
    }
}

