ZeroZap/XinYi/boards/pandora_stm32l475/rtos_main.c
static void isr_task(void *argument)
{
    (void)argument;
    for (;;) {
        if (xy_os_semaphore_acquire(pandora_isr_sem, 1500U) == XY_OS_OK) {
            uart_text("OSAL_ISR_TAKE\r\n");
        } else {
            uart_text("OSAL_ISR_TIMEOUT\r\n");
            fail();
        }
    }
}

static void tim6_irq_task(void *argument)
{
    (void)argument;
    if (xy_os_semaphore_acquire(pandora_tim6_sem, 1500U) != XY_OS_OK) {
        uart_text("OSAL_TIM6_IRQ_TIMEOUT\r\n");
        fail();
    }
    uart_text("OSAL_TIM6_IRQ_TAKE\r\n");
    if (xy_hal_timer_disable_irq(&pandora_tim6, XY_HAL_TIMER_EVENT_UPDATE) != XY_HAL_OK) {
        fail();
    }
    while (xy_os_semaphore_acquire(pandora_tim6_sem, XY_OS_NO_WAIT) == XY_OS_OK) {
    }
    if (xy_os_semaphore_acquire(pandora_tim6_sem, 900U) != XY_OS_ERROR_TIMEOUT) {
        uart_text("OSAL_TIM6_IRQ_RECOVERY_ERROR\r\n");
        fail();
    }
    uart_text("OSAL_TIM6_IRQ_TIMEOUT_EXPECTED\r\n");
    if (xy_hal_timer_enable_irq(&pandora_tim6, XY_HAL_TIMER_EVENT_UPDATE) != XY_HAL_OK ||
        xy_os_semaphore_acquire(pandora_tim6_sem, 1500U) != XY_OS_OK) {
        uart_text("OSAL_TIM6_IRQ_RECOVERY_ERROR\r\n");
        fail();
    }
    uart_text("OSAL_TIM6_IRQ_RECOVERED\r\n");
    for (;;) {
        if (xy_os_semaphore_acquire(pandora_tim6_sem, 1500U) == XY_OS_OK) {
            uart_text("OSAL_TIM6_IRQ_TAKE\r\n");
        } else {
            uart_text("OSAL_TIM6_IRQ_TIMEOUT\r\n");
            fail();
        }
    }
}

static void resource_task(void *argument)
{
    static const xy_os_mempool_attr_t pool_attr = {
        .name = "stress-pool",
        .mp_mem = resource_pool_memory,
        .mp_size = sizeof(resource_pool_memory),
    };
    uint32_t sequence = 0x12345678U;
    uint32_t received = 0U;
    uint32_t timeout_start;
    uint32_t timeout_elapsed;
    xy_os_mempool_id_t pool;
    xy_os_msgqueue_id_t queue;
    void *block0;
    void *block1;

    (void)argument;
    (void)xy_os_delay(250U);

    if (xy_broker_send_msg(XY_BROKER_SERVER_SENSOR, XY_BROKER_SERVER_SYSTEM,
                           XY_BROKER_MSG_SENSOR_DATA, &sequence, sizeof(sequence),
                           XY_BROKER_PRIORITY_NORMAL) != XY_BROKER_OK ||
        xy_broker_send_msg(XY_BROKER_SERVER_SENSOR, XY_BROKER_SERVER_SYSTEM,
                           XY_BROKER_MSG_SENSOR_DATA, &sequence, sizeof(sequence),
                           XY_BROKER_PRIORITY_NORMAL) != XY_BROKER_OK ||
        xy_broker_send_msg(XY_BROKER_SERVER_SENSOR, XY_BROKER_SERVER_SYSTEM,
                           XY_BROKER_MSG_SENSOR_DATA, &sequence, sizeof(sequence),
                           XY_BROKER_PRIORITY_NORMAL) != XY_BROKER_QUEUE_FULL) {
        uart_text("OSAL_IPC_SATURATION_ERROR\r\n");
        fail();
    }
    uart_text("OSAL_IPC_SATURATED\r\n");
    if (xy_broker_clear_queue(XY_BROKER_SERVER_SYSTEM) != XY_BROKER_OK) {
        uart_text("OSAL_IPC_SATURATION_ERROR\r\n");
        fail();
    }
    uart_text("OSAL_IPC_RECOVERED\r\n");

    ipc_probe_sequence = sequence;
    ipc_probe_reject = true;
    if (xy_broker_send_msg(XY_BROKER_SERVER_SENSOR, XY_BROKER_SERVER_SYSTEM,
                           XY_BROKER_MSG_SENSOR_DATA, &sequence, sizeof(sequence),
                           XY_BROKER_PRIORITY_NORMAL) != XY_BROKER_OK ||
        xy_broker_process_msgs(XY_BROKER_SERVER_SYSTEM, 1U) != XY_BROKER_ERROR ||
        xy_broker_get_pending_count(XY_BROKER_SERVER_SYSTEM) != 0) {
        uart_text("OSAL_IPC_HANDLER_RECOVERY_ERROR\r\n");
        fail();
    }
    uart_text("OSAL_IPC_HANDLER_REJECTED\r\n");
    ipc_probe_reject = false;
    if (xy_broker_send_msg(XY_BROKER_SERVER_SENSOR, XY_BROKER_SERVER_SYSTEM,
                           XY_BROKER_MSG_SENSOR_DATA, &sequence, sizeof(sequence),
                           XY_BROKER_PRIORITY_NORMAL) != XY_BROKER_OK ||
        xy_broker_process_msgs(XY_BROKER_SERVER_SYSTEM, 1U) != 1) {
        uart_text("OSAL_IPC_HANDLER_RECOVERY_ERROR\r\n");
        fail();
    }
    ipc_probe_sequence = UINT32_MAX;
    uart_text("OSAL_IPC_HANDLER_RECOVERED\r\n");

    pool = xy_os_mempool_new(2U, sizeof(uint32_t), &pool_attr);
    queue = xy_os_msgqueue_new(1U, sizeof(sequence), NULL);
    if (pool == NULL || queue == NULL) {
        uart_text("OSAL_RESOURCE_ERROR\r\n");
        fail();
    }
    block0 = xy_os_mempool_alloc(pool, XY_OS_NO_WAIT);
    block1 = xy_os_mempool_alloc(pool, XY_OS_NO_WAIT);
    if (block0 == NULL || block1 == NULL || xy_os_mempool_alloc(pool, XY_OS_NO_WAIT) != NULL ||
        xy_os_msgqueue_put(queue, &sequence, 0U, XY_OS_NO_WAIT) != XY_OS_OK ||
        xy_os_msgqueue_put(queue, &sequence, 0U, XY_OS_NO_WAIT) == XY_OS_OK) {
        uart_text("OSAL_RESOURCE_ERROR\r\n");
        fail();
    }
    uart_text("OSAL_RESOURCE_EXHAUSTED\r\n");

    timeout_start = xy_os_kernel_get_tick_count();
    if (xy_os_msgqueue_put(queue, &sequence, 0U, BLOCKING_TIMEOUT_TICKS) !=
        XY_OS_ERROR_TIMEOUT) {
        uart_text("OSAL_BLOCKING_TIMEOUT_ERROR\r\n");
        fail();
    }
    timeout_elapsed = xy_os_kernel_get_tick_count() - timeout_start;
    if (timeout_elapsed < BLOCKING_TIMEOUT_TICKS ||
        timeout_elapsed > BLOCKING_TIMEOUT_TICKS + BLOCKING_TIMEOUT_TOLERANCE_TICKS) {
        uart_text("OSAL_BLOCKING_TIMEOUT_ERROR\r\n");
        fail();
    }
    uart_text("OSAL_BLOCKING_TIMEOUT_OK\r\n");

    if (xy_os_mempool_free(pool, block0) != XY_OS_OK ||
        xy_os_mempool_alloc(pool, XY_OS_NO_WAIT) == NULL ||
        xy_os_msgqueue_get(queue, &received, NULL, XY_OS_NO_WAIT) != XY_OS_OK ||
        received != sequence ||
        xy_os_msgqueue_put(queue, &sequence, 0U, XY_OS_NO_WAIT) != XY_OS_OK) {
        uart_text("OSAL_RESOURCE_ERROR\r\n");
        fail();
    }
    uart_text("OSAL_RESOURCE_RECOVERED\r\n");

    if (xy_os_msgqueue_delete(queue) != XY_OS_OK || xy_os_mempool_delete(pool) != XY_OS_OK) {
        uart_text("OSAL_RESOURCE_ERROR\r\n");
        fail();
    }
    pool = xy_os_mempool_new(2U, sizeof(uint32_t), &pool_attr);
    queue = xy_os_msgqueue_new(1U, sizeof(sequence), NULL);
    if (pool == NULL || queue == NULL || xy_os_mempool_delete(pool) != XY_OS_OK ||
        xy_os_msgqueue_delete(queue) != XY_OS_OK) {
        uart_text("OSAL_RESOURCE_ERROR\r\n");
        fail();
    }
    uart_text("OSAL_LIFECYCLE_REINIT\r\n");
    xy_os_thread_exit();
}

static void dma_task(void *argument)
{
    static const xy_hal_dma_config_t config = {
        .direction = XY_HAL_DMA_DIR_MEM_TO_MEM,
        .mode = XY_HAL_DMA_MODE_NORMAL,
        .priority = XY_HAL_DMA_PRIORITY_HIGH,
        .periph_width = XY_HAL_DMA_WIDTH_WORD,
        .mem_width = XY_HAL_DMA_WIDTH_WORD,
        .periph_incr = XY_HAL_DMA_INCR_ENABLE,
        .mem_incr = XY_HAL_DMA_INCR_ENABLE,
    };

    (void)argument;
    (void)xy_os_delay(750U);
    __HAL_RCC_DMA1_CLK_ENABLE();
    dma1_channel1.Instance = DMA1_Channel1;
    for (uint32_t index = 0U; index < 8U; ++index) {
        dma_source[index] = 0x5A5A0000U | index;
        dma_destination[index] = 0U;
    }
    if (xy_hal_dma_init(&dma1_channel1, &config) != XY_HAL_OK) {
        uart_text("PANDORA_DMA_INIT_ERROR\r\n");
        fail();
    }
    if (xy_hal_dma_register_callback(&dma1_channel1, XY_HAL_DMA_EVENT_COMPLETE,
                                     dma_callback, NULL) != XY_HAL_OK ||
        xy_hal_dma_register_callback(&dma1_channel1, XY_HAL_DMA_EVENT_ERROR, dma_callback,
                                     NULL) != XY_HAL_OK) {
        uart_text("PANDORA_DMA_CALLBACK_ERROR\r\n");
        fail();
    }
    if (xy_hal_sys_set_irq_priority((uint32_t)DMA1_Channel1_IRQn, 6U) != XY_HAL_OK ||
        xy_hal_sys_enable_irq_num((uint32_t)DMA1_Channel1_IRQn) != XY_HAL_OK) {
        uart_text("PANDORA_DMA_IRQ_ERROR\r\n");
        fail();
    }
    if (xy_hal_dma_start(&dma1_channel1, (uint32_t)dma_source, (uint32_t)dma_destination,
                         8U) != XY_HAL_OK) {
        uart_text("PANDORA_DMA_START_ERROR\r\n");
        fail();
    }
    if (xy_os_semaphore_acquire(pandora_dma_sem, 100U) != XY_OS_OK ||
        dma_event != XY_HAL_DMA_EVENT_COMPLETE) {
        uart_text("PANDORA_DMA_IRQ_ERROR\r\n");
        fail();
    }
    if (xy_hal_sys_disable_irq_num((uint32_t)DMA1_Channel1_IRQn) != XY_HAL_OK) {
        uart_text("PANDORA_DMA_IRQ_ERROR\r\n");
        fail();
    }
    for (uint32_t index = 0U; index < 8U; ++index) {
        if (dma_destination[index] != dma_source[index]) {
            uart_text("PANDORA_DMA_COMPARE_ERROR\r\n");
            fail();
        }
    }
    if (xy_hal_dma_deinit(&dma1_channel1) != XY_HAL_OK) {
        uart_text("PANDORA_DMA_DEINIT_ERROR\r\n");
        fail();
    }
    uart_text("PANDORA_DMA_MEM2MEM_OK\r\n");
    uart_text("PANDORA_DMA_IRQ_CALLBACK_OK\r\n");
    for (uint32_t index = 0U; index < 8U; ++index) {
        dma_source[index] = 0xA5A50000U | index;
        dma_destination[index] = 0U;
    }
    if (xy_hal_dma_init(&dma1_channel1, &config) != XY_HAL_OK) {
        uart_text("PANDORA_DMA_REINIT_ERROR\r\n");
        fail();
    }
    if (xy_hal_dma_start(&dma1_channel1, (uint32_t)dma_source, (uint32_t)dma_destination,
                         8U) != XY_HAL_OK ||
        xy_hal_dma_stop(&dma1_channel1) != XY_HAL_OK) {
        uart_text("PANDORA_DMA_STOP_ERROR\r\n");
        fail();
    }
    if (xy_hal_dma_deinit(&dma1_channel1) != XY_HAL_OK ||
        xy_hal_dma_init(&dma1_channel1, &config) != XY_HAL_OK) {
        uart_text("PANDORA_DMA_REINIT_ERROR\r\n");
        fail();
    }
    if (xy_hal_dma_start(&dma1_channel1, (uint32_t)dma_source, (uint32_t)dma_destination,
                         8U) != XY_HAL_OK) {
        uart_text("PANDORA_DMA_RESTART_ERROR\r\n");
        fail();
    }
    if (xy_hal_dma_poll_complete(&dma1_channel1, 100U) != XY_HAL_OK) {
        uart_text("PANDORA_DMA_REPOLL_ERROR\r\n");
        fail();
    }
    for (uint32_t index = 0U; index < 8U; ++index) {
        if (dma_destination[index] != dma_source[index]) {
            uart_text("PANDORA_DMA_RECOMPARE_ERROR\r\n");
            fail();
        }
    }
    if (xy_hal_dma_deinit(&dma1_channel1) != XY_HAL_OK) {
        uart_text("PANDORA_DMA_REDEINIT_ERROR\r\n");
        fail();
    }
    uart_text("PANDORA_DMA_STOP_RECOVERY_OK\r\n");

    {
        const xy_hal_gpio_config_t gpio = {
            XY_HAL_GPIO_MODE_AF, XY_HAL_GPIO_PULL_UP, XY_HAL_GPIO_OTYPE_PP,
            XY_HAL_GPIO_SPEED_VERY_HIGH, GPIO_AF10_QUADSPI,
        };

        __HAL_RCC_GPIOE_CLK_ENABLE();
        __HAL_RCC_QSPI_CLK_ENABLE();
        for (uint8_t pin = 10U; pin <= 15U; ++pin) {
            if (xy_hal_gpio_init(GPIOE, pin, &gpio) != XY_HAL_OK) {
                uart_text("PANDORA_W25Q128_JEDEC_ID_ERROR\r\n");
                fail();
            }
        }

        qspi.Instance = QUADSPI;
        {
            if (xy_hal_qspi_init(&qspi, &w25q128_qspi_config) != XY_HAL_OK ||
                xy_w25q128_init(&w25q128, &qspi, "pandora-w25q128") != XY_W25Q128_OK ||
                xy_device_find("pandora-w25q128") != &w25q128.device) {
                uart_text("PANDORA_W25Q128_JEDEC_ID_ERROR\r\n");
                fail();
            }
        }
        if (w25q128_mcu_reset_recovery_pending != 0U) {
            uint8_t recovered[W25Q128_TEST_LENGTH];

