ZeroZap/XinYi/boards/pandora_stm32l475/rtos_main.c
            if (xy_w25q128_read(&w25q128, W25Q128_TEST_ADDRESS, recovered,
                                 sizeof(recovered)) != XY_W25Q128_OK) {
                uart_text("PANDORA_W25Q128_MCU_RESET_ERROR\r\n");
                fail();
            }
            for (uint32_t index = 0U; index < W25Q128_TEST_LENGTH; ++index) {
                if (recovered[index] != (uint8_t)(index ^ 0x5AU)) {
                    uart_text("PANDORA_W25Q128_MCU_RESET_ERROR\r\n");
                    fail();
                }
            }
            uart_text("PANDORA_W25Q128_MCU_RESET_RECOVERED\r\n");
        }
        uart_text("PANDORA_W25Q128_JEDEC_ID_OK\r\n");
        if (!w25q128_erase_write_read_test()) {
            uart_text("PANDORA_W25Q128_ERASE_WRITE_READ_ERROR\r\n");
            fail();
        }
        uart_text("PANDORA_W25Q128_ERASE_WRITE_READ_OK\r\n");
        uart_text("PANDORA_W25Q128_PERSISTENCE_STAGED\r\n");
        if (xy_hal_qspi_deinit(&qspi) != XY_HAL_OK ||
            xy_hal_qspi_init(&qspi, &w25q128_qspi_config) != XY_HAL_OK) {
            uart_text("PANDORA_W25Q128_PERSISTENCE_ERROR\r\n");
            fail();
        }
        {
            uint8_t persisted[W25Q128_TEST_LENGTH];

            if (xy_w25q128_read(&w25q128, W25Q128_TEST_ADDRESS, persisted,
                                 sizeof(persisted)) != XY_W25Q128_OK) {
                uart_text("PANDORA_W25Q128_PERSISTENCE_ERROR\r\n");
                fail();
            }
            for (uint32_t index = 0U; index < W25Q128_TEST_LENGTH; ++index) {
                if (persisted[index] != (uint8_t)(index ^ 0xA5U)) {
                    uart_text("PANDORA_W25Q128_PERSISTENCE_ERROR\r\n");
                    fail();
                }
            }
        }
        uart_text("PANDORA_W25Q128_PERSISTENCE_RECOVERED\r\n");
        if (!w25q128_quad_read_test()) {
            uart_text("PANDORA_W25Q128_QUAD_READ_ERROR\r\n");
            fail();
        }
        uart_text("PANDORA_W25Q128_QUAD_READ_OK\r\n");
        if (!w25q128_quad_program_test()) {
            uart_text("PANDORA_W25Q128_QUAD_PROGRAM_ERROR\r\n");
            fail();
        }
        uart_text("PANDORA_W25Q128_QUAD_PROGRAM_OK\r\n");
        {
            const xy_fota_flash_ops_t *fota_ops;
            xy_fota_t fota;
            xy_fota_config_t fota_config = {
                .mode = XY_FOTA_MODE_DUAL_BANK,
                .flash_base_addr = W25Q128_FOTA_TEST_ADDRESS,
                .slot_size = W25Q128_FOTA_TEST_SIZE,
                .slot_count = 1U,
                .enable_rollback = true,
                .min_version = 1U,
            };
            uint8_t candidate[300];
            uint8_t readback[300] = {0};
            uint32_t candidate_crc;

            for (uint32_t index = 0U; index < sizeof(candidate); ++index) {
                candidate[index] = (uint8_t)(index ^ 0x3CU);
            }
            candidate_crc = xy_fota_calc_crc32(candidate, sizeof(candidate));
            if (xy_fota_w25q128_bind(&w25q128, W25Q128_FOTA_TEST_ADDRESS,
                                      W25Q128_FOTA_TEST_SIZE, 1000U) != XY_FOTA_OK ||
                (fota_ops = xy_fota_w25q128_ops()) == NULL || fota_ops->init() != XY_FOTA_OK ||
                fota_ops->erase(W25Q128_FOTA_TEST_ADDRESS, sizeof(candidate)) != XY_FOTA_OK ||
                xy_fota_init(&fota, &fota_config) != XY_FOTA_OK ||
                xy_fota_set_flash_ops(&fota, fota_ops) != XY_FOTA_OK ||
                xy_fota_start_download(&fota, 2U, sizeof(candidate), false) != XY_FOTA_OK ||
                xy_fota_set_expected_crc32(&fota, candidate_crc) != XY_FOTA_OK ||
                xy_fota_download_chunk(&fota, candidate, 173U) != XY_FOTA_OK ||
                xy_fota_download_chunk(&fota, candidate + 173U, sizeof(candidate) - 173U) !=
                    XY_FOTA_OK ||
                xy_fota_finish_download(&fota) != XY_FOTA_OK ||
                fota_ops->read(W25Q128_FOTA_TEST_ADDRESS, readback, sizeof(readback)) !=
                    XY_FOTA_OK ||
                fota_ops->deinit() != XY_FOTA_OK) {
                uart_text("PANDORA_W25Q128_FOTA_DOWNLOAD_CRC_ERROR\r\n");
                fail();
            }
            for (uint32_t index = 0U; index < sizeof(candidate); ++index) {
                if (readback[index] != candidate[index]) {
                    uart_text("PANDORA_W25Q128_FOTA_DOWNLOAD_CRC_ERROR\r\n");
                    fail();
                }
            }
            uart_text("PANDORA_W25Q128_FOTA_DOWNLOAD_CRC_OK\r\n");
        }
        if (!w25q128_fota_full_image_test()) {
            uart_text("PANDORA_W25Q128_FOTA_FULL_IMAGE_ERROR\r\n");
            uart_text("PANDORA_FOTA_BOOTABLE_CANDIDATE_ERROR\r\n");
            fail();
        }
        uart_text("PANDORA_W25Q128_FOTA_FULL_IMAGE_OK\r\n");
        uart_text("PANDORA_FOTA_BOOTABLE_CANDIDATE_VALIDATED\r\n");
        if (w25q128_mcu_reset_recovery_pending == 0U) {
#ifndef PANDORA_IPC_ISR_STRESS_ONLY
            if (xy_hal_rtc_backup_write(0U, W25Q128_MCU_RESET_MAGIC) != XY_HAL_OK) {
                fail();
            }
            uart_text("PANDORA_W25Q128_MCU_RESET_STAGED\r\n");
            (void)xy_hal_sys_software_reset();
            fail();
#endif
        }
        if (xy_hal_qspi_deinit(&qspi) != XY_HAL_OK) {
            uart_text("PANDORA_W25Q128_PERSISTENCE_ERROR\r\n");
            fail();
        }
    }

    {
        static const xy_hal_spi_config_t spi_config = {
            .mode = XY_HAL_SPI_MODE_0,
            .direction = XY_HAL_SPI_DIR_2LINES,
            .datasize = XY_HAL_SPI_DATASIZE_8BIT,
            .firstbit = XY_HAL_SPI_FIRSTBIT_MSB,
            .nss = XY_HAL_SPI_NSS_SOFT,
            .baudrate_prescaler = SPI_BAUDRATEPRESCALER_16,
            .is_master = 1U,
        };
        static const xy_hal_dma_config_t spi_dma_config = {
            .direction = XY_HAL_DMA_DIR_MEM_TO_PERIPH,
            .mode = XY_HAL_DMA_MODE_NORMAL,
            .priority = XY_HAL_DMA_PRIORITY_HIGH,
            .periph_width = XY_HAL_DMA_WIDTH_BYTE,
            .mem_width = XY_HAL_DMA_WIDTH_BYTE,
            .periph_incr = XY_HAL_DMA_INCR_DISABLE,
            .mem_incr = XY_HAL_DMA_INCR_ENABLE,
        };
        static uint8_t spi_tx_data[16] = {
            0xA5U, 0x5AU, 0x00U, 0xFFU, 0x11U, 0x22U, 0x33U, 0x44U,
            0x55U, 0x66U, 0x77U, 0x88U, 0x99U, 0xAAU, 0xBBU, 0xCCU,
        };

