ZeroZap/XinYi/boards/pandora_stm32l475/rtos_main.c
        __HAL_RCC_SPI1_CLK_ENABLE();
        spi1_tx_dma.Instance = DMA1_Channel3;
        spi1_tx_dma.Init.Request = DMA_REQUEST_1;
        if (xy_hal_dma_init(&spi1_tx_dma, &spi_dma_config) != XY_HAL_OK) {
            uart_text("PANDORA_SPI_DMA_ERROR\r\n");
            fail();
        }
        spi1.Instance = SPI1;
        spi1.hdmatx = &spi1_tx_dma;
        spi1_tx_dma.Parent = &spi1;
        if (xy_hal_sys_set_irq_priority((uint32_t)DMA1_Channel3_IRQn, 6U) != XY_HAL_OK ||
            xy_hal_sys_enable_irq_num((uint32_t)DMA1_Channel3_IRQn) != XY_HAL_OK) {
            uart_text("PANDORA_SPI_DMA_ERROR\r\n");
            fail();
        }
        if (xy_hal_spi_init(&spi1, &spi_config) != XY_HAL_OK ||
            xy_hal_spi_register_callback(&spi1, spi_callback, NULL) != XY_HAL_OK ||
            xy_hal_spi_transmit_dma(&spi1, spi_tx_data, sizeof(spi_tx_data)) != XY_HAL_OK ||
            xy_os_semaphore_acquire(pandora_dma_sem, 100U) != XY_OS_OK ||
            spi_event != XY_HAL_SPI_EVENT_TX_DONE ||
            xy_hal_spi_deinit(&spi1) != XY_HAL_OK ||
            xy_hal_dma_deinit(&spi1_tx_dma) != XY_HAL_OK) {
            uart_text("PANDORA_SPI_DMA_ERROR\r\n");
            fail();
        }
        uart_text("PANDORA_SPI_DMA_TX_OK\r\n");
        spi_event = XY_HAL_SPI_EVENT_ERROR;
        if (xy_hal_dma_init(&spi1_tx_dma, &spi_dma_config) != XY_HAL_OK ||
            xy_hal_spi_init(&spi1, &spi_config) != XY_HAL_OK ||
            xy_hal_spi_register_callback(&spi1, spi_callback, NULL) != XY_HAL_OK ||
            xy_hal_spi_transmit_dma(&spi1, spi_tx_data, sizeof(spi_tx_data)) != XY_HAL_OK ||
            xy_os_semaphore_acquire(pandora_dma_sem, 100U) != XY_OS_OK ||
            spi_event != XY_HAL_SPI_EVENT_TX_DONE ||
            xy_hal_spi_deinit(&spi1) != XY_HAL_OK ||
            xy_hal_dma_deinit(&spi1_tx_dma) != XY_HAL_OK) {
            uart_text("PANDORA_SPI_DMA_RECOVERY_ERROR\r\n");
            fail();
        }
        uart_text("PANDORA_SPI_DMA_RECOVERY_OK\r\n");
        spi_event = XY_HAL_SPI_EVENT_ERROR;
        if (xy_hal_dma_init(&spi1_tx_dma, &spi_dma_config) != XY_HAL_OK ||
            xy_hal_spi_init(&spi1, &spi_config) != XY_HAL_OK ||
            xy_hal_spi_register_callback(&spi1, spi_callback, NULL) != XY_HAL_OK ||
            xy_hal_spi_transmit_dma(&spi1, spi_tx_data, sizeof(spi_tx_data)) != XY_HAL_OK ||
            xy_hal_spi_stop(&spi1) != XY_HAL_OK || xy_hal_spi_deinit(&spi1) != XY_HAL_OK ||
            xy_hal_dma_deinit(&spi1_tx_dma) != XY_HAL_OK ||
            xy_hal_dma_init(&spi1_tx_dma, &spi_dma_config) != XY_HAL_OK ||
            xy_hal_spi_init(&spi1, &spi_config) != XY_HAL_OK ||
            xy_hal_spi_register_callback(&spi1, spi_callback, NULL) != XY_HAL_OK ||
            xy_hal_spi_transmit_dma(&spi1, spi_tx_data, sizeof(spi_tx_data)) != XY_HAL_OK ||
            xy_os_semaphore_acquire(pandora_dma_sem, 100U) != XY_OS_OK ||
            spi_event != XY_HAL_SPI_EVENT_TX_DONE ||
            xy_hal_spi_deinit(&spi1) != XY_HAL_OK ||
            xy_hal_dma_deinit(&spi1_tx_dma) != XY_HAL_OK) {
            uart_text("PANDORA_SPI_DMA_ABORT_RECOVERY_ERROR\r\n");
            fail();
        }
        uart_text("PANDORA_SPI_DMA_ABORT_RECOVERY_OK\r\n");
    }
    xy_os_thread_exit();
}

static void multi_producer_task(void *argument)
{
    multi_message_t message = {.producer = (uint32_t)(uintptr_t)argument};
    uint32_t producer_done;

    (void)xy_os_delay(1500U);
    for (message.sequence = 0U; message.sequence < MULTI_MESSAGES_PER_PRODUCER;
         ++message.sequence) {
        if (xy_os_msgqueue_put(multi_queue, &message, 0U, 1000U) != XY_OS_OK) {
            uart_text("OSAL_MULTI_PRODUCER_ERROR\r\n");
            fail();
        }
        (void)xy_os_delay(7U + message.producer);
    }

    if (xy_os_mutex_acquire(sync_mutex, 100U) != XY_OS_OK) {
        uart_text("OSAL_MULTI_PRODUCER_ERROR\r\n");
        fail();
    }
    producer_done = ++multi_producers_done;
    if (xy_os_mutex_release(sync_mutex) != XY_OS_OK) {
        fail();
    }
    if (producer_done == 2U) {
        message.producer = MULTI_STOP_PRODUCER;
        message.sequence = 0U;
        if (xy_os_msgqueue_put(multi_queue, &message, 0U, 1000U) != XY_OS_OK ||
            xy_os_msgqueue_put(multi_queue, &message, 0U, 1000U) != XY_OS_OK) {
            uart_text("OSAL_MULTI_PRODUCER_ERROR\r\n");
            fail();
        }
    }
    xy_os_thread_exit();
}

static void multi_consumer_task(void *argument)
{
    multi_message_t message;
    uint32_t consumer = (uint32_t)(uintptr_t)argument;
    uint32_t consumer_done;

    if (consumer >= 2U) {
        uart_text("OSAL_MULTI_CONSUMER_ERROR\r\n");
        fail();
    }
    for (;;) {
        if (xy_os_msgqueue_get(multi_queue, &message, NULL, 3000U) != XY_OS_OK) {
            uart_text("OSAL_MULTI_CONSUMER_ERROR\r\n");
            fail();
        }
        if (message.producer == MULTI_STOP_PRODUCER) {
            break;
        }
        if (message.producer >= 2U || message.sequence >= MULTI_MESSAGES_PER_PRODUCER ||
            xy_os_mutex_acquire(sync_mutex, 100U) != XY_OS_OK) {
            uart_text("OSAL_MULTI_CONSUMER_ERROR\r\n");
            fail();
        }
        if ((multi_seen[message.producer] & (1UL << message.sequence)) != 0U) {
            uart_text("OSAL_MULTI_CONSUMER_ERROR\r\n");
            fail();
        }
        multi_seen[message.producer] |= 1UL << message.sequence;
        ++multi_received_count;
        ++multi_consumer_counts[consumer];
        if (xy_os_mutex_release(sync_mutex) != XY_OS_OK) {
            fail();
        }
        uart_text(consumer == 0U ? "OSAL_MULTI_CONSUMER_0_TAKE\r\n"
                                 : "OSAL_MULTI_CONSUMER_1_TAKE\r\n");
        (void)xy_os_delay(1U);
    }

    if (xy_os_mutex_acquire(sync_mutex, 100U) != XY_OS_OK) {
        uart_text("OSAL_MULTI_CONSUMER_ERROR\r\n");
        fail();
    }
    consumer_done = ++multi_consumers_done;
    if (consumer_done == 2U) {
        if (multi_received_count != 2U * MULTI_MESSAGES_PER_PRODUCER ||
            multi_seen[0] != ((1UL << MULTI_MESSAGES_PER_PRODUCER) - 1U) ||
            multi_seen[1] != ((1UL << MULTI_MESSAGES_PER_PRODUCER) - 1U) ||
            multi_consumer_counts[0] == 0U || multi_consumer_counts[1] == 0U) {
            uart_text("OSAL_MULTI_CONSUMER_ERROR\r\n");
            fail();
        }
        uart_text("OSAL_MULTI_CONSUMER_DISTRIBUTED\r\n");
        uart_text("OSAL_MULTI_PRODUCER_OK\r\n");
    }
    if (xy_os_mutex_release(sync_mutex) != XY_OS_OK) {
        fail();
    }
    xy_os_thread_exit();
}

