ZeroZap/XinYi/boards/pandora_stm32l475/rtos_main.c
static void pm_sleep_task(void *argument)
{
    xy_pm_system_state_info_t state;
    uint32_t cycle;

    (void)argument;
    (void)xy_os_delay(2000U);
    if (xy_pm_init() != XY_PM_OK) {
        uart_text("OSAL_PM_SLEEP_ERROR\r\n");
        fail();
    }
    for (cycle = 1U; cycle <= 32U; ++cycle) {
        uart_text("OSAL_PM_SLEEP_ENTER\r\n");
        if (xy_pm_enter_sleep() != XY_PM_OK || xy_pm_get_state(&state) != XY_PM_OK ||
            state.state != XY_PM_SYSTEM_STATE_SLEEP) {
            uart_text("OSAL_PM_SLEEP_ERROR\r\n");
            fail();
        }
        uart_text("OSAL_PM_WAKE_IRQ\r\n");
        if (xy_pm_wakeup() != XY_PM_OK || xy_pm_get_state(&state) != XY_PM_OK ||
            state.state != XY_PM_SYSTEM_STATE_IDLE) {
            uart_text("OSAL_PM_WAKE_ERROR\r\n");
            fail();
        }
        uart_text("OSAL_PM_SLEEP_WAKE_OK\r\n");
        uart_u32("OSAL_PM_SLEEP_CYCLE ", cycle);
        (void)xy_os_delay(10U);
    }
    uart_text("OSAL_PM_SLEEP_REPEAT_OK\r\n");
    xy_os_thread_exit();
}

int main(void)
{
    static const xy_os_thread_attr_t fast_attr = {
        .name = "osal-fast",
        .stack_size = 512U,
        .priority = XY_OS_PRIORITY_NORMAL,
    };
    static const xy_os_thread_attr_t slow_attr = {
        .name = "osal-slow",
        .stack_size = 512U,
        .priority = XY_OS_PRIORITY_LOW,
    };
    static const xy_os_thread_attr_t isr_attr = {
        .name = "osal-isr",
        .stack_size = 512U,
        .priority = XY_OS_PRIORITY_ABOVE_NORMAL,
    };
    static const xy_os_thread_attr_t resource_attr = {
        .name = "osal-resource",
        .stack_size = 768U,
        .priority = XY_OS_PRIORITY_NORMAL,
    };
    static const xy_os_thread_attr_t tim6_attr = {
        .name = "osal-tim6",
        .stack_size = 512U,
        .priority = XY_OS_PRIORITY_ABOVE_NORMAL,
    };
    static const xy_os_thread_attr_t multi_attr = {
        .name = "osal-multi",
        .stack_size = 512U,
        .priority = XY_OS_PRIORITY_NORMAL,
    };
    static const xy_os_thread_attr_t dma_attr = {
        .name = "hal-dma",
        .stack_size = 1536U,
        .priority = XY_OS_PRIORITY_NORMAL,
    };
    static const xy_os_thread_attr_t pm_sleep_attr = {
        .name = "pm-sleep",
        .stack_size = 768U,
        .priority = XY_OS_PRIORITY_NORMAL,
    };

#ifdef PANDORA_FOTA_APPLICATION
    SCB->VTOR = 0x08008000U;
#else
    SCB->VTOR = 0x08000000U;
#endif
    if (xy_hal_sys_init() != XY_HAL_OK) {
        fail();
    }
    if (pandora_platform_startup() != 0) {
        fail();
    }
    gpio_uart_init();

    tim6_init();
    uint32_t backup_value = 0U;
    if (xy_hal_rtc_backup_read(0U, &backup_value) != XY_HAL_OK) {
        fail();
    }
    if (backup_value == W25Q128_MCU_RESET_MAGIC) {
        w25q128_mcu_reset_recovery_pending = 1U;
        if (xy_hal_rtc_backup_write(0U, 0U) != XY_HAL_OK) {
            fail();
        }
    }
    uart_text("PANDORA STM32L475VE XINYI OSAL FREERTOS READY\r\n");
    uart_text("FIRMWARE_COMMIT " XINYI_FIRMWARE_COMMIT "\r\n");
#ifdef PANDORA_FOTA_APPLICATION
    if (xy_hal_rtc_backup_read(1U, &backup_value) != XY_HAL_OK) {
        fail();
    }
    if (backup_value == PANDORA_FOTA_CONFIRM_ACK_MAGIC) {
        if (xy_hal_rtc_backup_write(1U, 0U) != XY_HAL_OK) {
            fail();
        }
        uart_text("PANDORA_FOTA_CONFIRM_ACKNOWLEDGED\r\n");
    } else if (w25q128_mcu_reset_recovery_pending != 0U) {
        if (xy_hal_rtc_backup_write(1U, PANDORA_FOTA_CONFIRM_REQUEST_MAGIC) != XY_HAL_OK) {
            fail();
        }
        uart_text("PANDORA_FOTA_CONFIRM_REQUESTED\r\n");
        (void)xy_hal_sys_software_reset();
        fail();
    }
#endif
    uart_text("OSAL_STRESS_READY\r\n");

    xy_stdio_printf_init(uart_log_text);
    if (xy_os_kernel_init() != XY_OS_OK || xy_device_init() != XY_DEVICE_OK ||
        xy_device_register(&ipc_device) != XY_DEVICE_OK ||
        xy_broker_init() != XY_BROKER_OK ||
        xy_broker_register_server(XY_BROKER_SERVER_SYSTEM, ipc_handler, NULL) != XY_BROKER_OK ||
        xy_broker_register_server(XY_BROKER_SERVER_TIMER, ipc_handler, NULL) != XY_BROKER_OK ||
        (sync_sem = xy_os_semaphore_new(1U, 0U, NULL)) == NULL ||
        (sync_queue = xy_os_msgqueue_new(2U, sizeof(uint32_t), NULL)) == NULL ||
        (sync_events = xy_os_event_flags_new(NULL)) == NULL ||
        (sync_mutex = xy_os_mutex_new(NULL)) == NULL ||
        (multi_queue = xy_os_msgqueue_new(4U, sizeof(multi_message_t), NULL)) == NULL ||
        (pandora_isr_sem = xy_os_semaphore_new(1U, 0U, NULL)) == NULL ||
        (pandora_tim6_sem = xy_os_semaphore_new(1U, 0U, NULL)) == NULL ||
        (pandora_dma_sem = xy_os_semaphore_new(1U, 0U, NULL)) == NULL ||
        (pandora_ipc_isr_sem = xy_os_semaphore_new(1U, 0U, NULL)) == NULL ||
        xy_broker_isr_ingress_init(&pandora_ipc_isr_ingress, pandora_ipc_isr_storage, 4U,
                                   ipc_isr_wake, pandora_ipc_isr_sem) != XY_BROKER_OK ||
        xy_os_thread_new(fast_task, NULL, &fast_attr) == NULL ||
        xy_os_thread_new(slow_task, NULL, &slow_attr) == NULL ||
        xy_os_thread_new(isr_task, NULL, &isr_attr) == NULL ||
        xy_os_thread_new(ipc_isr_task, NULL, &isr_attr) == NULL ||
        xy_os_thread_new(tim6_irq_task, NULL, &tim6_attr) == NULL ||
        xy_os_thread_new(resource_task, NULL, &resource_attr) == NULL ||
        xy_os_thread_new(dma_task, NULL, &dma_attr) == NULL ||
        xy_os_thread_new(multi_producer_task, (void *)(uintptr_t)0U, &multi_attr) == NULL ||
        xy_os_thread_new(multi_producer_task, (void *)(uintptr_t)1U, &multi_attr) == NULL ||
        xy_os_thread_new(multi_consumer_task, (void *)(uintptr_t)0U, &multi_attr) == NULL ||
        xy_os_thread_new(multi_consumer_task, (void *)(uintptr_t)1U, &multi_attr) == NULL ||
        xy_os_thread_new(pm_sleep_task, NULL, &pm_sleep_attr) == NULL) {
        fail();
    }

    if (xy_hal_timer_enable_irq(&pandora_tim6, XY_HAL_TIMER_EVENT_UPDATE) != XY_HAL_OK) {
        fail();
    }
    (void)xy_os_kernel_start();
    fail();
}
